<?php
/*
 * @Author: hujiayucc
 * @Date: 2022-07-26 04:22:19
 * @Description: 文件描述
 */

header("Content-Type: application/json");
require_once('./Lib/init.php');

/**
 * 输出日志示例
 * API::输出日志("输出调试HTTPAPI", 黑色, 白色);
 * 颜色代码在Lib文件夹下的Color.php文件里，如需更多颜色请自行添加
 */

/**
 * 发送好友消息示例
 * API::发送好友消息(1908187655, 2792607647, "测试");
 */

/**
 * 发送群消息示例
 * API::发送群消息(1908187655, 703195149, "测试", 留空, 假);
 */

/**
 * 上传好友图片示例
 * API::上传好友图片(1908187655, 2792607647, "https://q1.qlogo.cn/g?b=qq&nk=2792607647&s=640", 文件类型_网络);
 * API::上传好友图片(1908187655, 2792607647, "E:\图片\icons.png", 文件类型_本地);
 */

/**
 * 上传群图片示例
 * API::上传群图片(1908187655,703195149, "https://q1.qlogo.cn/g?b=qq&nk=2792607647&s=640", 文件类型_网络);
 * API::上传群图片(1908187655, 703195149, "E:\图片\icons.png", 文件类型_本地);
 */
