<?php
/*
 * @Author: hujiayucc
 * @Date: 2022-07-31 04:49:46
 * @Description: 数据类型
 */

const 真 = true;
const 假 = false;
const 是 = true;
const 否 = false;
const 留空 = null;

const 语音类型_普通语音 = 0;
const 语音类型_变声语音 = 1;
const 语音类型_文字语音 = 2;
const 语音类型_红包匹配语音 = 3;

const 文件类型_本地 = "path";
const 文件类型_网络 = "url";

const 群权限_发起新的群聊 = "newgroup";
const 群权限_发起临时会话 = "newtempsession";
const 群权限_上传文件 = "uploadfile";
const 群权限_上传图片 = "uploadimage";
const 群权限_邀请好友加群 = "invitefriend";
const 群权限_匿名聊天 = "anonymouschat";
const 群权限_坦白说 = "tanbaishuo";
const 群权限_新成员查看历史消息 = "viewhistmsg";

const 群权限2_邀请方式设置 = "setinviteway";
const 群权限2_限制发言频率 = "limitmsgspd";
const 群权限2_设置群昵称规则 = "setnicknamerule";
const 群权限2_设置群查找方式 = "setsearchway";
const 群权限2_无需审核 = 1;
const 群权限2_需要审核 = 3;
const 群权限2_100人以内无要审核 = 3;
const 群权限2_发言无限制 = 0;
const 群权限2_不允许查找 = 0;
const 群权限2_通过群号和关键词 = 1;
const 群权限2_仅可通过群号 = 2;

const 消息类型_群聊消息 = "group";
const 消息类型_私聊消息 = "private";
const 消息类型_讨论组消息 = "discussion";

const 事件类型_私聊消息 = "privatemsg";
const 事件类型_群聊消息 = "groupmsg";
const 事件类型_事件 = "eventmsg";
const 事件类型_频道推送数据 = "guildpush";

const 名片类型_好友 = "Friend";
const 名片类型_群聊 = "Group";

function getEventType(int $type): string
{
    $array = [
        1       =>  "群事件_我被邀请加入群",
        2       =>  "群事件_某人加入了群",
        3       =>  "群事件_某人申请加群",
        4       =>  "群事件_群被解散",
        5       =>  "群事件_某人退出了群",
        6       =>  "群事件_某人被踢出群",
        7       =>  "群事件_某人被禁言",
        8       =>  "群事件_某人撤回事件",
        9       =>  "群事件_某人被取消管理",
        10      =>  "群事件_某人被赋予管理",
        11      =>  "群事件_开启全员禁言",
        12      =>  "群事件_关闭全员禁言",
        13      =>  "群事件_开启匿名聊天",
        14      =>  "群事件_关闭匿名聊天",
        15      =>  "群事件_开启坦白说",
        16      =>  "群事件_关闭坦白说",
        17      =>  "群事件_允许群临时会话",
        18      =>  "群事件_禁止群临时会话",
        19      =>  "群事件_允许发起新的群聊",
        20      =>  "群事件_禁止发起新的群聊",
        21      =>  "群事件_允许上传群文件",
        22      =>  "群事件_禁止上传群文件",
        23      =>  "群事件_允许上传相册",
        24      =>  "群事件_禁止上传相册",
        25      =>  "群事件_某人被邀请入群",
        26      =>  "群事件_展示成员群头衔",
        27      =>  "群事件_隐藏成员群头衔",
        28      =>  "群事件_某人被解除禁言",
        32      =>  "群事件_群名变更",
        33      =>  "群事件_系统提示",
        34      =>  "群事件_群头像事件",
        35      =>  "群事件_入场特效",
        36      =>  "群事件_修改群名片",
        37      =>  "群事件_群被转让",
        40      =>  "群事件_匿名被禁言",
        41      =>  "群事件_匿名被解除禁言",
        42      =>  "群事件_某人的加群申请被拒绝",
        43      =>  "群事件_展示群互动标识",
        44      =>  "群事件_隐藏群互动标识",
        45      =>  "群事件_展示群成员等级",
        46      =>  "群事件_隐藏群成员等级",
        29      =>  "空间事件_与我相关",
        31      =>  "框架事件_登录成功",
        38      =>  "框架事件_登录失败",
        39      =>  "框架事件_即将重启更新自身",
        300     =>  "讨论组事件_讨论组名变更",
        301     =>  "讨论组事件_某人撤回事件",
        302     =>  "讨论组事件_某人被邀请入群",
        303     =>  "讨论组事件_某人退出了群",
        304     =>  "讨论组事件_某人被踢出群",
        100     =>  "好友事件_被好友删除",
        101     =>  "好友事件_签名变更",
        102     =>  "好友事件_昵称改变",
        103     =>  "好友事件_某人撤回事件",
        104     =>  "好友事件_有新好友",
        105     =>  "好友事件_好友请求",
        106     =>  "好友事件_对方同意了您的好友请求",
        107     =>  "好友事件_对方拒绝了您的好友请求",
        108     =>  "好友事件_资料卡点赞",
        109     =>  "好友事件_签名点赞",
        110     =>  "好友事件_签名回复",
        111     =>  "好友事件_个性标签点赞",
        112     =>  "好友事件_随心贴回复",
        113     =>  "好友事件_随心贴增添",
        114     =>  "好友事件_系统提示",
        115     =>  "好友事件_随心贴点赞",
        116     =>  "好友事件_匿名提问_被提问",
        117     =>  "好友事件_匿名提问_被点赞",
        118     =>  "好友事件_匿名提问_被回复",
        119     =>  "好友事件_输入状态",
        200     =>  "登录事件_电脑上线",
        201     =>  "登录事件_电脑下线",
        202     =>  "登录事件_移动设备上线",
        203     =>  "登录事件_移动设备下线",
        204     =>  "登录事件_其他应用登录验证请求",

    ];
    if ($array[$type] != "")
        return $array[$type];
    else
        return "未知类型事件";
}
